# -*- coding: utf-8 -*-
"""
Charles Truscott
ЧАРЛьЗ ТРУСКОТТ
runfile('C:/Users/user/Desktop/РУТ.py', wdir='C:/Users/user/Desktop')
guess: 655996.5 high: 1311993 low: 0 numguesses: 0
guess: 327998.25 high: 655996.5 low: 0 numguesses: 1
guess: 163999.125 high: 327998.25 low: 0 numguesses: 2
guess: 81999.5625 high: 163999.125 low: 0 numguesses: 3
guess: 40999.78125 high: 81999.5625 low: 0 numguesses: 4
guess: 20499.890625 high: 40999.78125 low: 0 numguesses: 5
guess: 10249.9453125 high: 20499.890625 low: 0 numguesses: 6
guess: 5124.97265625 high: 10249.9453125 low: 0 numguesses: 7
guess: 2562.486328125 high: 5124.97265625 low: 0 numguesses: 8
guess: 1281.2431640625 high: 2562.486328125 low: 0 numguesses: 9
guess: 640.62158203125 high: 1281.2431640625 low: 0 numguesses: 10
guess: 320.310791015625 high: 640.62158203125 low: 0 numguesses: 11
guess: 160.1553955078125 high: 320.310791015625 low: 0 numguesses: 12
guess: 80.07769775390625 high: 160.1553955078125 low: 0 numguesses: 13
guess: 40.038848876953125 high: 80.07769775390625 low: 0 numguesses: 14
guess: 20.019424438476562 high: 40.038848876953125 low: 0 numguesses: 15
guess: 10.009712219238281 high: 20.019424438476562 low: 0 numguesses: 16
guess: 15.014568328857422 high: 20.019424438476562 low: 10.009712219238281 numguesses: 17
guess: 17.516996383666992 high: 20.019424438476562 low: 15.014568328857422 numguesses: 18
guess: 16.265782356262207 high: 17.516996383666992 low: 15.014568328857422 numguesses: 19
guess: 16.8913893699646 high: 17.516996383666992 low: 16.265782356262207 numguesses: 20
guess: 16.578585863113403 high: 16.8913893699646 low: 16.265782356262207 numguesses: 21
guess: 16.734987616539 high: 16.8913893699646 low: 16.578585863113403 numguesses: 22
guess: 16.656786739826202 high: 16.734987616539 low: 16.578585863113403 numguesses: 23
guess: 16.695887178182602 high: 16.734987616539 low: 16.656786739826202 numguesses: 24
guess: 16.7154373973608 high: 16.734987616539 low: 16.695887178182602 numguesses: 25
guess: 16.7252125069499 high: 16.734987616539 low: 16.7154373973608 numguesses: 26
guess: 16.73010006174445 high: 16.734987616539 low: 16.7252125069499 numguesses: 27
guess: 16.732543839141726 high: 16.734987616539 low: 16.73010006174445 numguesses: 28
guess: 16.733765727840364 high: 16.734987616539 low: 16.732543839141726 numguesses: 29
guess: 16.733154783491045 high: 16.733765727840364 low: 16.732543839141726 numguesses: 30
guess: 16.733460255665705 high: 16.733765727840364 low: 16.733154783491045 numguesses: 31
guess: 16.733612991753034 high: 16.733765727840364 low: 16.733460255665705 numguesses: 32
guess: 16.73353662370937 high: 16.733612991753034 low: 16.733460255665705 numguesses: 33
guess: 16.733498439687537 high: 16.73353662370937 low: 16.733460255665705 numguesses: 34
guess: 16.73347934767662 high: 16.733498439687537 low: 16.733460255665705 numguesses: 35
guess: 16.73348889368208 high: 16.733498439687537 low: 16.73347934767662 numguesses: 36
guess: 16.73348412067935 high: 16.73348889368208 low: 16.73347934767662 numguesses: 37
guess: 16.733481734177985 high: 16.73348412067935 low: 16.73347934767662 numguesses: 38
guess: 16.733480540927303 high: 16.733481734177985 low: 16.73347934767662 numguesses: 39
guess: 16.733481137552644 high: 16.733481734177985 low: 16.733480540927303 numguesses: 40
guess: 16.733481435865315 high: 16.733481734177985 low: 16.733481137552644 numguesses: 41
guess: 16.73348128670898 high: 16.733481435865315 low: 16.733481137552644 numguesses: 42
guess: 16.733481361287147 high: 16.733481435865315 low: 16.73348128670898 numguesses: 43
guess: 16.733481323998063 high: 16.733481361287147 low: 16.73348128670898 numguesses: 44
guess: 16.733481342642605 high: 16.733481361287147 low: 16.733481323998063 numguesses: 45
guess: 16.733481333320334 high: 16.733481342642605 low: 16.733481323998063 numguesses: 46
guess: 16.73348133798147 high: 16.733481342642605 low: 16.733481333320334 numguesses: 47
guess: 16.7334813356509 high: 16.73348133798147 low: 16.733481333320334 numguesses: 48
guess: 16.733481334485617 high: 16.7334813356509 low: 16.733481333320334 numguesses: 49
guess: 16.733481333902976 high: 16.733481334485617 low: 16.733481333320334 numguesses: 50
The 5 root of 1311993 is 16.733481333611657. 16.733481333611657 ** 5 = 1311993.000048479
1311993 ЗТО 5 РУТ 16.733481333611657

"""
import math

def main():
    гиссйс = 0
    ыпс = 0.000001
    куаж = 1311993
    хи = куаж
    лу = 0
    гисс = (хи + лу) / 2.0
    n = 10
    ЙКСПОНЕНТ = 5

    while(round((гисс ** ЙКСПОНЕНТ), 4) != (куаж)):
        while (((гисс ** ЙКСПОНЕНТ) >= (куаж) or (гисс ** ЙКСПОНЕНТ) <= (куаж) and (not (гисс ** ЙКСПОНЕНТ) == (куаж)))):
            print("guess: {} high: {} low: {} numguesses: {}".format(гисс, хи, лу, гиссйс))
            if ((гисс ** ЙКСПОНЕНТ) > куаж):
                хи = гисс
            elif ((гисс ** ЙКСПОНЕНТ) < куаж):
                лу = гисс
            гиссйс += 1
            гисс = (хи + лу) / 2.0
            if (round((гисс ** ЙКСПОНЕНТ), 4) == (round((куаж), 4))):
                break
                    
        
        print("The {} root of {} is {}. {} ** {} = {}".format(ЙКСПОНЕНТ, куаж, гисс, гисс,ЙКСПОНЕНТ, гисс ** ЙКСПОНЕНТ))
        print("{} ЗТО {} РУТ {}".format(куаж, ЙКСПОНЕНТ, гисс))

   
    
if __name__ == "__main__": main()